
//Пусть дан список сотрудников:Иван Иванов и остальные, полный текст дз будет на платформе)
//Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений.
//Отсортировать по убыванию популярности.

//package hm_5;
//
//import java.util.HashMap;
//import java.util.Map;
//
//public class problem_2 {
//    public static void main(String[] args) {
//        Map<String, String> db = new HashMap<>();
//        db.put("Светлана", "Петрова");
//        db.put("Кристина", "Белова");
//        db.put("Анна", "Мусина");
//        db.put("Анна", "Крутова");
//        db.put("Иван", "Юрин");
//        db.put("Петр", "Лыков");
//        db.put("Павел", "Чернов");
//        db.put("Петр", "Чернышов");
//        db.put("Мария", "Федорова");
//        db.put("Марина", "Светлова");
//        db.put("Иван", "Савин");
//        db.put("Мария", "Рыкова");
//        db.put("Марина", "Лугова");
//        db.put("Анна", "Владимирова");
//        db.put("Иван", "Мечников");
//        db.put("Петр", "Петин");
//        db.put("Иван", "Ежов");
//
//
//
//    }
//}
